namespace Пример_цикла_for
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //      for (нач_знач переменной цикла; условие работы цикла; шаг изменения переменной цикла)
            //      { последовательность операторов; }

            // Найти сумму чисел из диапазона  0 1000, кратных 5.
            int i; // переменная цикла
            int Sum = 0; //начальное значение суммы 
            for (i = 0; i <= 1000; i += 5)
            {
                Sum += i;
            }
            Console.Write("Сумма равна " + Sum);
        }


    }
}
